tap "1password/tap"
tap "adoptopenjdk/openjdk"
tap "argon/mas"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "railwaycat/emacsmacport"
tap "rcmdnk/file"
tap "sanemat/font"
tap "shopify/shopify"
tap "stripe/stripe-cli"

# Formulae
brew "abseil"
brew "act"
brew "asdf"
brew "autoconf"
brew "autojump"
brew "automake"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "bat"
brew "brew-file"
brew "cairo"
brew "cmake"
brew "composer"
brew "coreutils"
brew "curl"
brew "docker-compose"
brew "ffmpeg"
brew "flyctl"
brew "gawk"
brew "gh"
brew "ghq"
brew "git-delta"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "harfbuzz"
brew "heroku"
brew "hub"
brew "imagemagick"
brew "jpeg-xl"
brew "jq"
brew "libfido2"
brew "libpq"
brew "librsvg"
brew "lv"
brew "marp-cli"
brew "mas"
brew "mkcert"
brew "mongosh"
brew "mysql"
brew "mysql@8.0"
brew "nkf"
brew "node"
brew "node@16"
brew "openjdk"
brew "openjdk@11"
brew "openjdk@17"
brew "pango"
brew "peco"
brew "postgresql@14"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "rbenv"
brew "redis"
brew "ruby"
brew "stripe"
brew "tfenv"
brew "the_silver_searcher"
brew "themekit"
brew "tig"
brew "tree"
brew "uv"
brew "vim"
brew "volta"
brew "watch"
brew "wget"
brew "yarn"
brew "zplug"
brew "zsh"

# Casks
cask "alt-tab"
cask "appcleaner"
cask "authy"
cask "bartender"
cask "bettertouchtool"
cask "cleanshot"
cask "coteditor"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "duet"
cask "figma"
cask "firefox"
cask "focus"
cask "font-ipaexfont"
cask "gather"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "grandperspective"
cask "graphql-playground"
cask "gyazo"
cask "iterm2"
cask "java6"
cask "karabiner-elements"
cask "kindle"
cask "mysqlworkbench"
cask "ngrok"
cask "orbstack"
cask "raycast"
cask "sequel-pro"
cask "skitch"
cask "slack"
cask "the-unarchiver"
cask "tripmode"
cask "visual-studio-code"
cask "zoom"

# Mac App Store
mas "Amphetamine", id: 937984704
mas "Day One", id: 1055511498
mas "Keynote", id: 409183694
mas "iMovie", id: 408981434
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Prime Video", id: 545519333
mas "Session", id: 1521432881
mas "Todoist", id: 585829637

# VS Code Extensions
vscode "aaron-bond.better-comments"
vscode "beilunyang.cursor-rules"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "chouzz.vscode-better-align"
vscode "christian-kohler.path-intellisense"
vscode "circleci.circleci"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "genieai.chatgpt-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "gracefulpotato.rbs-syntax"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "ionutvmi.path-autocomplete"
vscode "itarato.byesig"
vscode "jacobpfeifer.pfeifer-hurl"
vscode "jebbs.plantuml"
vscode "kaiwood.endwise"
vscode "kimuson.ts-type-expand"
vscode "marp-team.marp-vscode"
vscode "mateuszdrewniak.rails-full-stack-extension-pack"
vscode "mateuszdrewniak.ruby-runner"
vscode "mateuszdrewniak.ruby-test-runner"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "misogi.ruby-rubocop"
vscode "mohd-akram.vscode-html-format"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "ninoseki.vscode-gem-lens"
vscode "ninoseki.vscode-mogami"
vscode "nucllear.vscode-extension-auto-import"
vscode "oderwat.indent-rainbow"
vscode "pranaygp.vscode-css-peek"
vscode "shardulm94.trailing-spaces"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sorbet.sorbet-vscode-extension"
vscode "sporto.rails-go-to-spec"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "thadeu.vscode-run-rspec-file"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
