tap "1password/tap"
tap "adoptopenjdk/openjdk"
tap "argon/mas"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "railwaycat/emacsmacport"
tap "rcmdnk/file"
tap "sanemat/font"
tap "shopify/shopify"
brew "jpeg-xl"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "asdf"
brew "python@3.10"
brew "autojump"
brew "python@3.11"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "bat"
brew "bluetoothconnector"
brew "cairo"
brew "circleci"
brew "cmake"
brew "curl"
brew "libpq"
brew "php"
brew "composer"
brew "docker-compose"
brew "gawk"
brew "ghq"
brew "git-delta"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "hub"
brew "jq"
brew "libfido2"
brew "lv"
brew "mas"
brew "mongosh"
brew "mysql"
brew "nkf"
brew "openjdk"
brew "openjdk@11"
brew "peco"
brew "perl"
brew "plantuml"
brew "postgresql@14"
brew "pyenv"
brew "python@3.8"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "tfenv"
brew "the_silver_searcher"
brew "tig"
brew "tree"
brew "vim"
brew "volta"
brew "watch"
brew "wget"
brew "yarn"
brew "zplug"
brew "zsh"
brew "heroku/brew/heroku"
brew "rcmdnk/file/brew-file"
brew "shopify/shopify/themekit"
cask "1password-cli"
cask "alfred", args: { appdir: "/Applications" }
cask "alt-tab"
cask "alternote", args: { appdir: "/Applications" }
cask "appcleaner", args: { appdir: "/Applications" }
cask "authy", args: { appdir: "/Applications" }
cask "bartender", args: { appdir: "/Applications" }
cask "bettertouchtool", args: { appdir: "/Applications" }
cask "biscuit"
cask "cleanshot"
cask "coteditor", args: { appdir: "/Applications" }
cask "dash", args: { appdir: "/Applications" }
cask "discord", args: { appdir: "/Applications" }
cask "docker"
cask "dropbox", args: { appdir: "/Applications" }
cask "duet"
cask "figma", args: { appdir: "/Applications" }
cask "firefox", args: { appdir: "/Applications" }
cask "focus"
cask "gather"
cask "google-cloud-sdk", args: { appdir: "/Applications" }
cask "google-japanese-ime"
cask "grandperspective", args: { appdir: "/Applications" }
cask "gyazo", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "java6", args: { appdir: "/Applications" }
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "kindle", args: { appdir: "/Applications" }
cask "mysqlworkbench", args: { appdir: "/Applications" }
cask "ngrok", args: { appdir: "/Applications" }
cask "sequel-pro", args: { appdir: "/Applications" }
cask "skitch", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "the-unarchiver", args: { appdir: "/Applications" }
cask "tripmode", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "warp"
cask "zoom", args: { appdir: "/Applications" }
mas "Amphetamine", id: 937984704
mas "Day One", id: 1055511498
mas "Deckset", id: 847496013
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "MeetingBar", id: 1532419400
mas "MonitorControlLite", id: 1595464182
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Todoist", id: 585829637
mas "Unsplash Wallpapers", id: 1284863847
mas "Xcode", id: 497799835
mas "Yoink", id: 457622435
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "bierner.color-info"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "gencay.vscode-chatgpt"
vscode "genieai.chatgpt-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-labs"
vscode "GitHub.vscode-pull-request-github"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hediet.vscode-drawio"
vscode "ICS.japanese-proofreading"
vscode "ionutvmi.path-autocomplete"
vscode "jebbs.plantuml"
vscode "kaiwood.endwise"
vscode "kimuson.ts-type-expand"
vscode "kyoshidajp.vscode-tosa"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "misogi.ruby-rubocop"
vscode "mohd-akram.vscode-html-format"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "myml.vscode-markdown-plantuml-preview"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pranaygp.vscode-css-peek"
vscode "Prisma.prisma"
vscode "rebornix.ruby"
vscode "sianglim.slim"
vscode "sporto.rails-go-to-spec"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "Thadeu.vscode-run-rspec-file"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wingrunr21.vscode-ruby"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "Yog.yog-plantuml-highlight"
