tap "1password/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "railwaycat/emacsmacport"
tap "rcmdnk/file"
tap "sanemat/font"
tap "shopify/shopify"
tap "stripe/stripe-cli"

brew "jpeg-xl"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "asdf"
brew "autojump"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "cairo"
brew "circleci"
brew "cmake"
brew "curl"
brew "libpq"
brew "php"
brew "composer"
brew "docker-compose"
brew "gawk"
brew "ghq"
brew "git-delta"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "hub"
brew "jq"
brew "libfido2"
brew "lv"
brew "mas"
brew "mongosh"
brew "mysql@8.0"
brew "nkf"
brew "openjdk"
brew "orbstack"
brew "openjdk@11"
brew "peco"
brew "perl"
brew "plantuml"
brew "postgresql@14"
brew "pyenv"
brew "python@3.8"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "tfenv"
brew "the_silver_searcher"
brew "tig"
brew "tree"
brew "vim"
brew "volta"
brew "watch"
brew "wget"
brew "yarn"
brew "zplug"
brew "zsh"
brew "heroku/brew/heroku"
brew "rcmdnk/file/brew-file"
brew "shopify/shopify/themekit"

cask "alt-tab"
cask "appcleaner"
cask "authy"
cask "bartender"
cask "bettertouchtool"
cask "biscuit"
cask "cleanshot"
cask "coteditor"
cask "dash"
cask "discord"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox"
cask "focus"
cask "font-ipaexfont"
cask "gather"
cask "google-cloud-sdk"
cask "google-japanese-ime"
cask "grandperspective"
cask "graphql-playground"
cask "gyazo"
cask "iterm2"
cask "karabiner-elements"
cask "kindle"
cask "mysqlworkbench"
cask "ngrok"
cask "orbstack"
cask "raycast"
cask "slack"
cask "the-unarchiver"
cask "tripmode"
cask "visual-studio-code"
cask "zoom"

mas "Amphetamine", id: 937984704
mas "Day One", id: 1055511498
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Prime Video", id: 545519333
mas "Session", id: 1521432881
mas "Todoist", id: 585829637
mas "Xcode", id: 497799835

vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "bierner.color-info"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "gencay.vscode-chatgpt"
vscode "genieai.chatgpt-vscode"
vscode "GitHub.copilot"
vscode "GitHub.copilot-labs"
vscode "GitHub.vscode-pull-request-github"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hediet.vscode-drawio"
vscode "ICS.japanese-proofreading"
vscode "ionutvmi.path-autocomplete"
vscode "jebbs.plantuml"
vscode "kaiwood.endwise"
vscode "kimuson.ts-type-expand"
vscode "kyoshidajp.vscode-tosa"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "misogi.ruby-rubocop"
vscode "mohd-akram.vscode-html-format"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "myml.vscode-markdown-plantuml-preview"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pranaygp.vscode-css-peek"
vscode "Prisma.prisma"
vscode "rebornix.ruby"
vscode "sianglim.slim"
vscode "sporto.rails-go-to-spec"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "Thadeu.vscode-run-rspec-file"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wingrunr21.vscode-ruby"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "Yog.yog-plantuml-highlight"
