4ops.terraform
aaron-bond.better-comments
amiralizadeh9480.laravel-extra-intellisense
bierner.color-info
bierner.markdown-preview-github-styles
bmewburn.vscode-intelephense-client
bung87.rails
bung87.vscode-gemfile
castwide.solargraph
casualjim.gotemplate
christian-kohler.path-intellisense
codingyu.laravel-goto-view
CoenraadS.bracket-pair-colorizer
cssho.vscode-svgviewer
dbaeumer.vscode-eslint
eamodio.gitlens
ecmel.vscode-html-css
EditorConfig.EditorConfig
esbenp.prettier-vscode
formulahendry.auto-rename-tag
GitHub.copilot
glitchbl.laravel-create-view
GraphQL.vscode-graphql
GraphQL.vscode-graphql-syntax
hediet.vscode-drawio
higoka.php-cs-fixer
ICS.japanese-proofreading
IHunte.laravel-blade-wrapper
ionutvmi.path-autocomplete
jebbs.plantuml
kimuson.ts-type-expand
kyoshidajp.vscode-tosa
marp-team.marp-vscode
mechatroner.rainbow-csv
mikestead.dotenv
mohd-akram.vscode-html-format
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vsliveshare.vsliveshare
myml.vscode-markdown-plantuml-preview
naoray.laravel-goto-components
naumovs.color-highlight
octref.vetur
oderwat.indent-rainbow
onecentlin.laravel-blade
onecentlin.laravel-extension-pack
onecentlin.laravel5-snippets
pranaygp.vscode-css-peek
Prisma.prisma
rebornix.ruby
ryannaddy.laravel-artisan
shufo.vscode-blade-formatter
sianglim.slim
stef-k.laravel-goto-controller
streetsidesoftware.code-spell-checker
Vense.rails-snippets
vscode-icons-team.vscode-icons
vscodevim.vim
willjleong.nuxt-typescript-snippets
wingrunr21.vscode-ruby
Yog.yog-plantuml-highlight
