aaron-bond.better-comments
amiralizadeh9480.laravel-extra-intellisense
bmewburn.vscode-intelephense-client
bung87.rails
bung87.vscode-gemfile
castwide.solargraph
casualjim.gotemplate
christian-kohler.path-intellisense
codingyu.laravel-goto-view
CoenraadS.bracket-pair-colorizer
ecmel.vscode-html-css
EditorConfig.EditorConfig
esbenp.prettier-vscode
felixfbecker.php-debug
felixfbecker.php-intellisense
felixfbecker.php-pack
formulahendry.auto-rename-tag
hediet.vscode-drawio
higoka.php-cs-fixer
ICS.japanese-proofreading
ionutvmi.path-autocomplete
jebbs.plantuml
mechatroner.rainbow-csv
mikestead.dotenv
ms-azuretools.vscode-docker
ms-vsliveshare.vsliveshare
octref.vetur
oderwat.indent-rainbow
onecentlin.laravel-blade
onecentlin.laravel-extension-pack
onecentlin.laravel5-snippets
pranaygp.vscode-css-peek
rebornix.ruby
ryannaddy.laravel-artisan
sianglim.slim
stef-k.laravel-goto-controller
Vense.rails-snippets
vscode-icons-team.vscode-icons
vscodevim.vim
wingrunr21.vscode-ruby
